---
kind: type
id: T:Autodesk.Revit.DB.SpecTypeId.String
source: html/838f3053-a30d-f80f-beff-2b04d710fbc9.htm
---
# Autodesk.Revit.DB.SpecTypeId.String

This class contains constants identifying string specs.

## Syntax (C#)
```csharp
public static class String
```